Create Data Frame

In [4]:
people = {
  "first" : ["fateme", "elham", "fateme"],
  "last" : ["seifi", "jaafari", "merghati"],
  "s_num" : [23,24,25]
}

In [5]:
import pandas as pd
import numpy as np

C:\Users\wq\AppData\Local\Temp\ipykernel_15252\2162656668.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [6]:
# create a dataframe using that dictioonary
df  = pd.DataFrame(people)
df

    first      last  s_num
0  fateme     seifi     23
1   elham   jaafari     24
2  fateme  merghati     25

In [7]:
# access a single column
df['first']

0    fateme
1     elham
2    fateme
Name: first, dtype: object

In [8]:
# type of a column
type(df['first'])
# rows of a single column

pandas.core.series.Series

In [9]:
#df.s_num
df['s_num']
# it is recommended to use the second approach

0    23
1    24
2    25
Name: s_num, dtype: int64

In [10]:
df[['first', 'last']]

    first      last
0  fateme     seifi
1   elham   jaafari
2  fateme  merghati

In [11]:
# show columns
df.columns

Index(['first', 'last', 's_num'], dtype='object')

In [12]:
# allows us to access rows by integer location
# get the first row:
df.iloc[0]

first    fateme
last      seifi
s_num        23
Name: 0, dtype: object

In [13]:
# get the first 2 rows:
df.iloc[[0, 1]]

    first     last  s_num
0  fateme    seifi     23
1   elham  jaafari     24

In [15]:
# get the rows and cols that we want:
df.iloc[[0, 1], 2]

0    23
1    24
Name: s_num, dtype: int64

In [16]:
# searching rows by labels
df.loc[[0, 2], 's_num']

0    23
2    25
Name: s_num, dtype: int64

In [17]:
# searching rows by labels
df.loc[[0, 2], ['last', 'first']]

       last   first
0     seifi  fateme
2  merghati  fateme

In [18]:
df.set_index('s_num',inplace=True)

Indexes: How to Set, Reset, and Use Indexes

In [19]:
df

        first      last
s_num
23     fateme     seifi
24      elham   jaafari
25     fateme  merghati

In [20]:
df.loc[25]

first      fateme
last     merghati
Name: 25, dtype: object

In [21]:
df.iloc[1]

first      elham
last     jaafari
Name: 24, dtype: object

In [22]:
df.reset_index(inplace=True)
df

   s_num   first      last
0     23  fateme     seifi
1     24   elham   jaafari
2     25  fateme  merghati

Filtering : Using Conditionals to Filter Rows and Columns

In [23]:
filt = (df['first'] == "fateme")

In [24]:
# all of the rows that have the first name of "fateme"
df[filt]
df[df['first'] == "fateme"]

   s_num   first      last
0     23  fateme     seifi
2     25  fateme  merghati

In [25]:
# show s_num of rows which have that filter
df.loc[filt, 's_num']

0    23
2    25
Name: s_num, dtype: int64

In [26]:
filt = ((df['first'] == 'fateme') & (df['last'] == 'merghati'))
df.loc[filt, 's_num']

2    25
Name: s_num, dtype: int64

In [27]:
filt = ((df['first'] == 'fateme') | (df['last'] == 'ziba'))
# gives the opisite filter
df.loc[~filt]

   s_num  first     last
1     24  elham  jaafari

Updating Rows and Columns - Modifying Data Within DataFrames

In [28]:
df.columns

Index(['s_num', 'first', 'last'], dtype='object')

In [29]:
df.columns = ['student_number', 'first_name', 'last_name']
df

   student_number first_name last_name
0              23     fateme     seifi
1              24      elham   jaafari
2              25     fateme  merghati

In [30]:
df.columns = [x.lower() for x in df.columns]
df

   student_number first_name last_name
0              23     fateme     seifi
1              24      elham   jaafari
2              25     fateme  merghati

In [31]:
 df.columns = df.columns.str.replace('_', ' ')
 df

   student number first name last name
0              23     fateme     seifi
1              24      elham   jaafari
2              25     fateme  merghati

In [32]:
df.rename(columns={'first name' : 'first',
                    'last name' : 'last',
                    'student number': 'snum' }, inplace=True)

In [33]:
df.columns = ['snum', 'first', 'last']
df

   snum   first      last
0    23  fateme     seifi
1    24   elham   jaafari
2    25  fateme  merghati

Update a single value

In [34]:
df.loc[2]

snum           25
first      fateme
last     merghati
Name: 2, dtype: object

In [35]:
df.loc[2] = [26, 'Sara', 'Ghiyasi']
df

   snum   first     last
0    23  fateme    seifi
1    24   elham  jaafari
2    26    Sara  Ghiyasi

In [36]:
df.loc[2, ['last', 'snum']] = ['Merghati', 25]
df

   snum   first      last
0    23  fateme     seifi
1    24   elham   jaafari
2    25    Sara  Merghati

In [37]:
df.loc[2, 'first'] = 'Fateme'
df.at[0, 'first'] = 'Fateme'
df

   snum   first      last
0    23  Fateme     seifi
1    24   elham   jaafari
2    25  Fateme  Merghati

In [38]:
flt = (df['snum'] == 24)

df.loc[flt, 'last'] = 'Jaafari'
df

   snum   first      last
0    23  Fateme     seifi
1    24   elham   Jaafari
2    25  Fateme  Merghati

In [39]:
df['first'] = df['first'].str.lower()

In [40]:
df

   snum   first      last
0    23  fateme     seifi
1    24   elham   Jaafari
2    25  fateme  Merghati

In [41]:
# apply: calling a func on a dataframe
# -- apply a func on every value in series:
df['last'].apply(len)

0    5
1    7
2    8
Name: last, dtype: int64

In [42]:
def update(first):
  return first.upper()

In [43]:
df['first'] = df['first'].apply(update)
df

   snum   first      last
0    23  FATEME     seifi
1    24   ELHAM   Jaafari
2    25  FATEME  Merghati

In [44]:
df['first'] = df['first'].apply(lambda x: x.lower())
df

   snum   first      last
0    23  fateme     seifi
1    24   elham   Jaafari
2    25  fateme  Merghati

In [45]:
# apply len func on cols
# output: each col have 3 values
df.apply(len)

snum     3
first    3
last     3
dtype: int64

In [46]:
# apply len func on rows
# output: each row has 3 values
df.apply(len, axis = 'columns')

0    3
1    3
2    3
dtype: int64

In [47]:
df.apply(pd.Series.min)

snum          23
first      elham
last     Jaafari
dtype: object

In [48]:
# x is a serie
df.apply(lambda x: x.min())

snum          23
first      elham
last     Jaafari
dtype: object

In [49]:
# applymap only works on dataframes. series and objects don't have applymap method
df.applymap(len)

C:\Users\wq\AppData\Local\Temp\ipykernel_15252\3534654458.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(len)

TypeError: object of type 'int' has no len()

In [ ]:
df.applymap(str.lower)

C:\Users\wq\AppData\Local\Temp\ipykernel_1704\357608748.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(str.lower)

TypeError: descriptor 'lower' for 'str' objects doesn't apply to a 'int' object

In [ ]:
df['first'].map({'fateme': 'Fatiii', 'elham': 'Eliii'})

0    Fatiii
1     Eliii
2    Fatiii
Name: first, dtype: object

In [ ]:
df['first'].replace({'fateme': 'Fatiii', 'elham': 'Eliii'})

0    Fatiii
1     Eliii
2    Fatiii
Name: first, dtype: object

In [ ]:
df

   snum   first      last
0    23  fateme     seifi
1    24   elham   Jaafari
2    25  fateme  Merghati

Add and remove columns

In [ ]:
df['first'] + ' ' + df['last']

0       fateme seifi
1      elham Jaafari
2    fateme Merghati
dtype: object

In [ ]:
# add a col
df['full name'] = df['first'] + ' ' + df['last']
df

   snum   first      last        full name
0    23  fateme     seifi     fateme seifi
1    24   elham   Jaafari    elham Jaafari
2    25  fateme  Merghati  fateme Merghati

In [ ]:
# remove col
df.drop(columns = ['first', 'last'], inplace=True)
df

   snum        full name
0    23     fateme seifi
1    24    elham Jaafari
2    25  fateme Merghati

In [ ]:
# split a col into 2 cols:
df['full name'].str.split(' ', expand = True)

        0         1
0  fateme     seifi
1   elham   Jaafari
2  fateme  Merghati

In [ ]:
df[['first', 'last']] = df['full name'].str.split(' ', expand = True)
df

   snum        full name   first      last
0    23     fateme seifi  fateme     seifi
1    24    elham Jaafari   elham   Jaafari
2    25  fateme Merghati  fateme  Merghati

Add and remove data

In [ ]:
df._append({'first':'Zahra'},ignore_index=True)

   snum        full name   first      last
0  23.0     fateme seifi  fateme     seifi
1  24.0    elham Jaafari   elham   Jaafari
2  25.0  fateme Merghati  fateme  Merghati
3   NaN              NaN   Zahra       NaN

In [ ]:
df

   snum        full name   first      last
0    23     fateme seifi  fateme     seifi
1    24    elham Jaafari   elham   Jaafari
2    25  fateme Merghati  fateme  Merghati

In [ ]:
people = {
  "snum" : [34,39],
  'full name': ['Peter Parker', 'Stephan Strange'],
  "first" : ["Peter", "Stephan"],
  "last" : ["Parker", "Strange"]
  
}
df2 = pd.DataFrame(people)
df2

   snum        full name    first     last
0    34     Peter Parker    Peter   Parker
1    39  Stephan Strange  Stephan  Strange

In [ ]:
# append a dataframe to another
df._append(df2, ignore_index=True, sort=False)

   snum        full name    first      last
0    23     fateme seifi   fateme     seifi
1    24    elham Jaafari    elham   Jaafari
2    25  fateme Merghati   fateme  Merghati
3    34     Peter Parker    Peter    Parker
4    39  Stephan Strange  Stephan   Strange

In [ ]:
df = df._append(df2, ignore_index=True, sort=False)
df

   snum        full name    first      last
0    23     fateme seifi   fateme     seifi
1    24    elham Jaafari    elham   Jaafari
2    25  fateme Merghati   fateme  Merghati
3    34     Peter Parker    Peter    Parker
4    39  Stephan Strange  Stephan   Strange

In [ ]:
df.drop(index=4)

   snum        full name   first      last
0    23     fateme seifi  fateme     seifi
1    24    elham Jaafari   elham   Jaafari
2    25  fateme Merghati  fateme  Merghati
3    34     Peter Parker   Peter    Parker

In [ ]:
#drop by filter
flt = df[df['first'] == 'fateme'].index
df.drop(index = flt)

   snum        full name    first     last
1    24    elham Jaafari    elham  Jaafari
3    34     Peter Parker    Peter   Parker
4    39  Stephan Strange  Stephan  Strange

Sort data

In [ ]:
# sort by lastname
df.sort_values(by='last')

   snum        full name    first      last
1    24    elham Jaafari    elham   Jaafari
2    25  fateme Merghati   fateme  Merghati
3    34     Peter Parker    Peter    Parker
4    39  Stephan Strange  Stephan   Strange
0    23     fateme seifi   fateme     seifi

In [ ]:
df.sort_values(by='last', ascending=False)

   snum        full name    first      last
0    23     fateme seifi   fateme     seifi
4    39  Stephan Strange  Stephan   Strange
3    34     Peter Parker    Peter    Parker
2    25  fateme Merghati   fateme  Merghati
1    24    elham Jaafari    elham   Jaafari

In [ ]:
df.sort_values(by=['first', 'last'], ascending=False)

   snum        full name    first      last
0    23     fateme seifi   fateme     seifi
2    25  fateme Merghati   fateme  Merghati
1    24    elham Jaafari    elham   Jaafari
4    39  Stephan Strange  Stephan   Strange
3    34     Peter Parker    Peter    Parker

In [ ]:
df.sort_values(by=['first', 'last'], ascending=[True, False], inplace=True)

In [ ]:
# set it back to how was before:
df.sort_index()

   snum        full name    first      last
0    23     fateme seifi   fateme     seifi
1    24    elham Jaafari    elham   Jaafari
2    25  fateme Merghati   fateme  Merghati
3    34     Peter Parker    Peter    Parker
4    39  Stephan Strange  Stephan   Strange

In [ ]:
# sort series:
df['first'].sort_values()

3      Peter
4    Stephan
1      elham
0     fateme
2     fateme
Name: first, dtype: object

Cleaning Data

In [ ]:
pp = {
  "first" : ["Fateme", "Elham", "Fateme", 'Zahra', np.nan, None, 'NA'],
  "last" : ["Seifi", "Jaafari", "Merghati", 'Pira', np.nan, np.nan, 'Missing'],
  "email" : ['fatemeseifi@gmail.com', 'elhamjaafari@gmail.com', 'fatememerghati@gmail.com', None, np.nan, 'Anonymous@gamil.com','NA'],
  "age": ['22', '21', '21', '22',None,None, 'Missing']
}

In [ ]:
df = pd.DataFrame(pp)

df.replace('NA', np.nan, inplace=True)
df.replace('Missing', np.nan, inplace=True)
df

    first      last                     email   age
0  Fateme     Seifi     fatemeseifi@gmail.com    22
1   Elham   Jaafari    elhamjaafari@gmail.com    21
2  Fateme  Merghati  fatememerghati@gmail.com    21
3   Zahra      Pira                      None    22
4     NaN       NaN                       NaN  None
5    None       NaN       Anonymous@gamil.com  None
6     NaN       NaN                       NaN   NaN

In [ ]:
# delete data with NAN or none (missing)value in any column
df.dropna()

    first      last                     email age
0  Fateme     Seifi     fatemeseifi@gmail.com  22
1   Elham   Jaafari    elhamjaafari@gmail.com  21
2  Fateme  Merghati  fatememerghati@gmail.com  21

In [ ]:
# same:
df.dropna(axis='index', how='any')

    first      last                     email age
0  Fateme     Seifi     fatemeseifi@gmail.com  22
1   Elham   Jaafari    elhamjaafari@gmail.com  21
2  Fateme  Merghati  fatememerghati@gmail.com  21

In [ ]:
# delete rows with all columns of missing value
df.dropna(axis='index', how='all')

    first      last                     email      age
0  Fateme     Seifi     fatemeseifi@gmail.com       22
1   Elham   Jaafari    elhamjaafari@gmail.com       21
2  Fateme  Merghati  fatememerghati@gmail.com       21
3   Zahra      Pira                      None       22
5    None       NaN       Anonymous@gamil.com     None
6      NA   Missing                        NA  Missing

In [ ]:
# delete column if all of values are missing
df.dropna(axis='columns', how='all')

    first      last                     email   age
0  Fateme     Seifi     fatemeseifi@gmail.com    22
1   Elham   Jaafari    elhamjaafari@gmail.com    21
2  Fateme  Merghati  fatememerghati@gmail.com    21
3   Zahra      Pira                      None    22
4     NaN       NaN                       NaN  None
5    None       NaN       Anonymous@gamil.com  None
6     NaN       NaN                       NaN   NaN

In [ ]:
# delete column if some of values are missing
df.dropna(axis='columns', how='any')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6]

In [ ]:
# delete rows if they have missing email
df.dropna(axis='index', how='any', subset=['email'])

    first      last                     email   age
0  Fateme     Seifi     fatemeseifi@gmail.com    22
1   Elham   Jaafari    elhamjaafari@gmail.com    21
2  Fateme  Merghati  fatememerghati@gmail.com    21
5    None       NaN       Anonymous@gamil.com  None

In [ ]:
# delete rows if they have missing email and missing last
df.dropna(axis='index', how='all', subset=['email', 'last'])

    first      last                     email   age
0  Fateme     Seifi     fatemeseifi@gmail.com    22
1   Elham   Jaafari    elhamjaafari@gmail.com    21
2  Fateme  Merghati  fatememerghati@gmail.com    21
3   Zahra      Pira                      None    22
5    None       NaN       Anonymous@gamil.com  None

In [ ]:
# display missing values:
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6   True   True   True   True

In [ ]:
# replace missing values with -
df.fillna('-')

    first      last                     email age
0  Fateme     Seifi     fatemeseifi@gmail.com  22
1   Elham   Jaafari    elhamjaafari@gmail.com  21
2  Fateme  Merghati  fatememerghati@gmail.com  21
3   Zahra      Pira                         -  22
4       -         -                         -   -
5       -         -       Anonymous@gamil.com   -
6       -         -                         -   -

In [ ]:
# show type of attributes:
df.dtypes

first    object
last     object
email    object
age      object
dtype: object

In [ ]:
# type of NAN is float
type(np.nan)

float

In [ ]:
# change the type of 'age' col to float bc NAN is also float
df['age'] = df['age'].astype(float)

In [ ]:
df['age'].mean()

21.5